Revit 2026 API

# PathOfTravelFindEndsOfShortestPaths Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<XYZ> FindEndsOfShortestPaths(
	View DBView,
	IList<XYZ> destinationPoints,
	IList<XYZ> startPoints
)
```
```vb
Public Shared Function FindEndsOfShortestPaths (
	DBView As View,
	destinationPoints As IList(Of XYZ),
	startPoints As IList(Of XYZ)
) As IList(Of XYZ)
```
```cpp
public:
static IList<XYZ^>^ FindEndsOfShortestPaths(
	View^ DBView,
	IList<XYZ^>^ destinationPoints,
	IList<XYZ^>^ startPoints
)
```
```fsharp
static member FindEndsOfShortestPaths :
        DBView : View *
        destinationPoints : IList<XYZ> *
        startPoints : IList<XYZ> -> IList<XYZ>
```

#### Parameters

DBView View

destinationPoints IListXYZ

startPoints IListXYZ

#### Return Value

IListXYZ

#### Reference

PathOfTravel Class

Autodesk.Revit.DB.Analysis Namespace